app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "surname", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sd"], ["surname", "sss"], ["created_at", 2016-12-02 16:26:59 UTC], ["updated_at", 2016-12-02 16:26:59 UTC]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save